feat: mermaid renderer + convertir diagramas plantuml a mermaid en post
